In [3]:
import pandas as pd

In [49]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [3]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
df1.tail()

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [14]:
df1.shape[0] 
print("no of rows:",df1.shape[0])

no of rows: 7

In [15]:
print("no of rows:",df1.shape[1])

no of rows: 3

In [13]:
df1.shape

(7, 3)

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [18]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [21]:
df1.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [22]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [23]:
df1['Gender'].nunique()

2

In [24]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [8]:
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [9]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [10]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [11]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [12]:
df1['Marks'].mean()

92.14285714285714

In [14]:
df1['Marks'].min()

83

In [15]:
df1['Marks'].max()

99

In [24]:
def divide(x):
    return x//2

In [21]:
df1['Half_marks'] = df1['Marks'].apply(divide)

In [22]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [26]:
df1['Marks'].apply(divide)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

df1['Marks'].apply(divide)

In [27]:
df1['Marks'].apply(divide)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [29]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [31]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [34]:
df1['Gender'].map({'Male':0,'Female':1})

0    0
1    1
2    1
3    0
4    0
5    1
6    1
Name: Gender, dtype: int64

In [35]:
df1['male_female_count'] = df1['Gender'].map({'Male':0,'Female':1})

In [36]:
df1

      Name  Marks  Gender  Half_marks  male_female_count
0  Priyang     98    Male        49.0                  0
1   Aadhya     89  Female        44.5                  1
2   Krisha     99  Female        49.5                  1
3   Vedant     87    Male        43.5                  0
4   Parshv     90    Male        45.0                  0
5   Mittal     83  Female        41.5                  1
6  Archana     99  Female        49.5                  1

In [40]:
df1.drop('male_female_count',axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [43]:
df1.drop(['Half_marks','Gender'],axis=1,inplace=True)

KeyError: "['Half_marks', 'Gender'] not found in axis"

In [44]:
df1

      Name  Marks  male_female_count
0  Priyang     98                  0
1   Aadhya     89                  1
2   Krisha     99                  1
3   Vedant     87                  0
4   Parshv     90                  0
5   Mittal     83                  1
6  Archana     99                  1

In [45]:
df1.columns

Index(['Name', 'Marks', 'male_female_count'], dtype='object')

In [48]:
df1.sort_values(by='Marks',ascending=True)

      Name  Marks  male_female_count
5   Mittal     83                  1
3   Vedant     87                  0
1   Aadhya     89                  1
4   Parshv     90                  0
0  Priyang     98                  0
2   Krisha     99                  1
6  Archana     99                  1

In [50]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [51]:
df1['Gender'] == 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [52]:
df1[df1['Gender'] == 'Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [53]:
df1[df1['Gender'] == 'Female'] ['Marks']

1    89
2    99
5    83
6    99
Name: Marks, dtype: int64

In [56]:
df1[df1['Gender'] == 'Female'] [['Marks','Name']]

   Marks     Name
1     89   Aadhya
2     99   Krisha
5     83   Mittal
6     99  Archana

In [57]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [58]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female